tap "b4nst/tap"
tap "cormacrelf/tap"
# tap "goreleaser/tap"
# tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
# tap "jason0x43/neovim-nightly"
# tap "mongodb/brew"
 
# brew "alexjs"
brew "ansible"
brew "bat"
brew "black"
# brew "ca-certificates"
brew "cask"
brew "coreutils"
brew "cormacrelf/tap/dark-notify"
brew "elm"
brew "eslint"
brew "exa"
brew "exercism"
brew "fd"
brew "fzf"
brew "fzy"
brew "gawk"
brew "gdbm"
brew "gh"
brew "git"
# brew "git-lfs"
brew "gnu-sed"
brew "gnupg"
brew "gnutls"
# brew "go"
brew "gofumpt"
brew "golangci-lint"
# brew "goreleaser/tap/goreleaser"
brew "grc"
# brew "guile"
# brew "heroku/brew/heroku"
brew "htop"
brew "hugo"
# brew "icu4c"
# brew "jq"
# brew "krb5"
brew "lazygit"
# brew "libgcrypt"
# brew "libgpg-error"
# brew "libidn"
# brew "libnghttp2"
# brew "libusb"
# brew "libuv"
# brew "libx11"
brew "luajit-openresty"
brew "luarocks"
brew "mas"
# brew "mongodb/brew/mongodb-community"
# brew "mongosh"
brew "mosh"
brew "ncdu"
brew "neofetch"
brew "neovim"
brew "netlify-cli"
# brew "nettle"
brew "node"
# brew "node@14"
# brew "node@16"
# brew "oniguruma"
brew "openssl@1.1"
brew "pandoc"
# brew "pcre2"
# brew "postgresql"
brew "pre-commit"
brew "prettier"
# brew "proselint"
# brew "protobuf"
brew "python"
# brew "python@3.10"
# brew "python@3.9"
brew "ranger"
brew "readline"
# brew "redis"
brew "ripgrep"
# brew "ruby"
brew "speedtest-cli"
brew "sqlite"
brew "stow"
brew "stylua"
brew "svn"
# brew "terminator"
brew "tldr"
brew "tmux"
brew "tree"
# brew "tree-sitter"
# brew "unbound"
# brew "unixodbc"
brew "wget"
brew "youtube-dl"
brew "z"

# cask "alacritty"
# cask "brave-browser"
# cask "gloomhaven-helper"
# cask "iterm2"
# cask "mactex"
# cask "safari-technology-preview"
cask "1password"
cask "alfred"
cask "airbuddy"
cask "basictex"
cask "brave-browser"
cask "cardhop"
cask "cheatsheet"
cask "devonthink"
cask "docker"
cask "dropbox"
cask "fantastical"
cask "fig"
cask "firefox"
cask "github"
cask "karabiner-elements"
cask "kitty"
cask "nordvpn"
cask "obsidian"
cask "setapp"
cask "temurin"
cask "textexpander"
cask "visual-studio-code"
cask "zoom"

cask "font-fira-mono-for-powerline"
cask "font-source-code-pro-for-powerline"
cask "font-ibm-plex-mono"

mas "1Password for Safari", id: 1569813296
mas "Magnet", id: 441258766 
mas "Microsoft OneDrive", id: 823766827
mas "Microsoft Word", id: 462054704
mas "Microsoft Excel", id: 462058435
mas "Microsoft PowerPoint", id: 462062816
# mas "Microsoft OneNote", id: 784801555
